dbbench-result/64m.txt
mod: 7
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    64000000
RawSize:    7080.1 MB (estimated)
FileSize:   4028.3 MB (estimated)
------------------------------------------------
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselineNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselinePositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMPositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
fillrandom   :       4.129 micros/op;   26.8 MB/s;   264.246
readrandom   :       5.993 micros/op;   18.5 MB/s (63999720 of 64000000 found);   383.575
--------------------------------------------------
memtable stall time: 0.702767 s
L0 stall time: 0  s
L0 slow stall time: 211.438  s
waf:15.2467
------About File Model------
total segments: 96138
final models : 173
avg segments: 555
------About File Model------
Timer 0: 8614033408 : 8.614033408
Timer 1: 3062073600 : 3.062073600
Timer 2: 15014624256 : 15.014624256
Timer 3: 15386516480 : 15.386516480
Timer 4: 0 : 0.000000000
Timer 5: 9232023552 : 9.232023552
Timer 6: 37891743744 : 37.891743744
Timer 7: 270966521856 : 270.966521856
Timer 8: 574650560 : 0.574650560
Timer 9: 0 : 0.000000000
Timer 10: 0 : 0.000000000
Timer 11: 1236310784 : 1.236310784
Timer 12: 17703755776 : 17.703755776
Timer 13: 0 : 0.000000000
Timer 14: 22262953984 : 22.262953984
Timer 15: 548256640 : 0.548256640
Timer 16: 21345196032 : 21.345196032
Timer 17: 7654350848 : 7.654350848
Timer 18: 5705329152 : 5.705329152
Timer 19: 5173479936 : 5.173479936

                               Compactions
Level  Files  Size(MB) Time(sec) M_Time(micros) Read(MB) Write(MB)  M_Read(MB) M_Write(MB) Count 
------------------------------------------------------------------------------------------------ 
  0         3         8       66         0        4504       6891          0          0      112
  1         6         7      113     84861       11101      10940          8          8     1204
  2        72        99       66    100435        7364       6751         12         13      922
  3       514       999        0         0           0          0          0          0        0
  4       260       498        0         0           0          0          0          0        0

Counter LevelModel 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FileModel 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Baseline 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Succeeded 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FalseInternal 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Compaction -2147483648 73347669120 143060095152 74536378932 1368358912 0 0 0 0
3599 1009 1231 1099 260 0 0 0 0
Counter Learn 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter SuccessTime 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FalseTime 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FilteredLookup -2147483648 2253570048 251379712 432324608 613154816 308527104 0 0 0
306365656 191195317 21172739 35963099 37860408 20174093 0 0 0
Counter PutWait 200871 200859 12 0 0 0 0 0 0
200871 200859 12 0 0 0 0 0 0
Counter FileLearning 886366208 23068672 20283392 843014144 0 0 0 0 0
173 3 6 164 0 0 0 0 0
Counter LevelLearn 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelModelUse 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelModelNotUse 204733238 0 63455059 63069305 58034501 20174373 0 0 0
204733238 0 63455059 63069305 58034501 20174373 0 0 0
Counter BaselineNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselinePositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMPositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0