dbbench-result/64m1.txt
mod: 7
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    64000000
RawSize:    7080.1 MB (estimated)
FileSize:   4028.3 MB (estimated)
------------------------------------------------
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselineNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselinePositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMPositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
fillrandom   :       4.141 micros/op;   26.7 MB/s;   264.995
readrandom   :       5.294 micros/op;   20.9 MB/s (63992587 of 64000000 found);   338.792
--------------------------------------------------
memtable stall time: 1.0103 s
L0 stall time: 0  s
L0 slow stall time: 212.217  s
waf:15.2313
------About File Model------
total segments: 416090
final models : 859
avg segments: 484
------About File Model------
Timer 0: 8604112896 : 8.604112896
Timer 1: 4309861376 : 4.309861376
Timer 2: 9050193920 : 9.050193920
Timer 3: 10090725376 : 10.090725376
Timer 4: 0 : 0.000000000
Timer 5: 5382746112 : 5.382746112
Timer 6: 35116384256 : 35.116384256
Timer 7: 272044785664 : 272.044785664
Timer 8: 625317312 : 0.625317312
Timer 9: 0 : 0.000000000
Timer 10: 0 : 0.000000000
Timer 11: 4624232960 : 4.624232960
Timer 12: 17866889216 : 17.866889216
Timer 13: 0 : 0.000000000
Timer 14: 18945497088 : 18.945497088
Timer 15: 370227296 : 0.370227296
Timer 16: 22374436864 : 22.374436864
Timer 17: 9150485504 : 9.150485504
Timer 18: 6318857728 : 6.318857728
Timer 19: 4892172800 : 4.892172800

                               Compactions
Level  Files  Size(MB) Time(sec) M_Time(micros) Read(MB) Write(MB)  M_Read(MB) M_Write(MB) Count 
------------------------------------------------------------------------------------------------ 
  0         2         5       69         0        4522       6908          0          0      112
  1         7         9      109     25971       11002      10841          1          1     1199
  2        82       100       69    127723        7426       6813         13         15      919
  3       511       998        0         0           0          0          0          0        0
  4       257       500        0         0           0          0          0          0        0

Counter LevelModel 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FileModel 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Baseline 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Succeeded 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FalseInternal 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Compaction -2147483648 76629161456 138042395384 78288198740 1459798016 0 0 0 0
3607 1009 1237 1104 257 0 0 0 0
Counter Learn 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter SuccessTime 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FalseTime 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FilteredLookup -2147483648 1487110144 306675712 623083520 471531520 256114688 0 0 0
261947865 127604781 25704407 50525429 37752987 20360261 0 0 0
Counter PutWait 201629 201607 22 0 0 0 0 0 0
201629 201607 22 0 0 0 0 0 0
Counter FileLearning -2147483648 15466496 32243712 261357568 3924557824 0 0 0 0
859 2 9 80 768 0 0 0 0
Counter LevelLearn 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelModelUse 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelModelNotUse 205190945 0 63594347 63115675 58113249 20367674 0 0 0
205190945 0 63594347 63115675 58113249 20367674 0 0 0
Counter BaselineNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselinePositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMPositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0